БИТУправление_медицинским_центром_демо/src/Documents/ТабельУчетаРабочегоВремени/ТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчетаРабочегоВремени</name>
  <registerRecords>InformationRegister.ТабельУчетаРабочегоВремени</registerRecords>
  <attributes>
    <name>Режим</name>
    <type>
      <types>EnumRef.ВидыУстановкиГрафиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОдномуФилиалу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Табель</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧислоМес31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ТабельУчетаРабочегоВремени/ТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТабельУчетаРабочегоВремени</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ТабельУчетаРабочегоВремени/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Очистка заполненных часов
Процедура ОчиститьСодержимоеТаблицыКромеСотрудников() Экспорт
	
	Для Каждого Стр Из Табель Цикл
		Для Инд = 1 По 31 Цикл
			Стр["ЧислоМес"+Инд] = 0;
		КонецЦикла;
		Стр.ИтогоДни = 0;
		Стр.ИтогоЧасы = 0;
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = НСтр("ru='Проведение документа'");
	Заголовок = Заголовок + " """ + СокрЛП(Ссылка) + """: ";
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Сотр = Табель.ВыгрузитьКолонку("Сотрудник");
	МасОшибок = Новый Массив;
	Для Инд = 0 По Сотр.Количество() - 1 Цикл
		
		Если Не ЗначениеЗаполнено(Сотр[Инд]) Тогда 
			МасОшибок.Добавить(НСтр("ru='Не заполнен сотрудник в строке'") + " " + (Инд + 1));
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если МасОшибок.Количество() > 0 Тогда
		
		Отказ = Истина;                    	
		
		Для Инд = 0 По МасОшибок.Количество() - 1 Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(МасОшибок[Инд]);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не проведен'"));
		Возврат;			
	КонецЕсли;	
	
	Если ПроверкаНаДублиСтрок(Ссылка,"Табель", "Сотрудник", Отказ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не проведен'"));
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Для Каждого СтрокаТаблицыИсточника Из Табель Цикл
			Для Инд = День(НачалоПериода) По День(КонецПериода) Цикл
				Часы = СтрокаТаблицыИсточника["ЧислоМес" + Инд];
				Если ЗначениеЗаполнено(Часы) Тогда
					НоваяЗапись = Движения.ТабельУчетаРабочегоВремени.Добавить();
					НоваяЗапись.День = НачалоМесяца(НачалоПериода) + 24 * 60 * 60 * (Инд - 1);
					НоваяЗапись.Сотрудник = СтрокаТаблицыИсточника["Сотрудник"];
					НоваяЗапись.Часы = Часы;
					НоваяЗапись.Дней = 1;
					Если ПоОдномуФилиалу Тогда 
						НоваяЗапись.Филиал = Филиал;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверка на дубли в столбце "сотрудник" табличной части "Табель".
//
// Параметры:
//  Ссылка		 - ДокументСсылка.ТабельУчетаРабочегоВремени - проверяемый документ.
//  ИмяТаблЧасти - Строка									 - Имя табличной части табеля документа.
//  Колонка		 - Строка									 - Имя проверяемой колонки.
//  Отказ		 - Булево									 - Признак отказа.
// 
// Возвращаемое значение:
//  Булево - признак наличия ошибки.
//
Функция ПроверкаНаДублиСтрок(Ссылка, ИмяТаблЧасти = "Табель", Колонка = "Сотрудник", Отказ = Ложь)
	
	ИмяДока = Ссылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|    Док." + Колонка + " КАК ID,
	|    ПРЕДСТАВЛЕНИЕ(Док." + Колонка + ") КАК Сверка, 
	|    Док.НомерСтроки КАК НомерСтроки,
	|    ДокКопия.НомерСтроки КАК НомерСтрокиКопия
	|ИЗ
	|    Документ." + ИмяДока + "." + ИмяТаблЧасти + " КАК Док
	|        СОЕДИНЕНИЕ Документ." + ИмяДока + "." + ИмяТаблЧасти + " КАК ДокКопия
	|        ПО Док." + Колонка + "= ДокКопия." + Колонка + "
	|            И Док.НомерСтроки < ДокКопия.НомерСтроки
	|ГДЕ
	|    Док.Ссылка = &Ссылка
	|    И ДокКопия.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|    ID,
	|    НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаСообщения = НСтр("ru='Проверка табличной части на дублирующиеся строки:
	|Обнаружены одинаковые позиции! Колонка'") + " " + Колонка;
	
	Пока Результат.Следующий() Цикл
		
		Значение = Результат.Сверка;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru='%1
										|Строка № %2 и строка № %3  значение: %4'"),
								СтрокаСообщения,
								Формат(Результат.НомерСтроки, "ЧГ="),
								Формат(Результат.НомерСтрокиКопия, "ЧГ="),
								Значение);
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти
